/* Даны два массива: [1, 2, 3] и[4, 5, 6].Объедините их вместе. */

/* 
var a = [1, 2, 3];
var b = [4, 5, 6];
var c = a.concat(b);
alert(c); */

/* Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert. */


/* var num;
num = 123;
alert(num); */

/* Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран. */
/* var a;
a = 10;
alert(a);
a = 20;
alert(a); */

/* Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a. */

/* var a = 1 + 2 + 3;
alert(a); */
/* Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
 */
/* var a = 10;
b = 2;
alert(a + b);
alert(a - b);
alert((a + b) / 2);
alert(a / b);
 */
/* Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
 */
/* var c = 10;
var d = 5;
var result = c + d;
alert(result);
 */
/* Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.
 */
/* var a = 1;
var b = 2;
var c = 3;
alert(a + b + c); */

/* Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result. */
/* let a = 10,
    b = 5;
var c = a - b;
var d = 7;
result = c + d;
alert(result); */